import { describe, expect, it } from 'bun:test';

import { DEFAULT_POETRY_OPTIONS } from './constants';
import { calculateAverageProseDensity, isPoeticGroup } from './poetry';

describe('poetry', () => {
    describe('isValidPoetryPair', () => {
        it('should detect the valid pair that takes up full width', () => {
            const actual = isPoeticGroup(
                [
                    {
                        bbox: {
                            height: 258.94726753234863,
                            width: 1865.3965878086237,
                            x: 572.5475456774307,
                            y: 3374.017852695907,
                        },
                        text: 'أنا عبدٌ أنا ربٌّ',
                    },
                    {
                        bbox: {
                            height: 258.94726753234863,
                            width: 1893.100440338368,
                            x: 2557.994506287425,
                            y: 3374.0178519176575,
                        },
                        text: 'أنا عز أنا ذلَّ',
                    },
                ],
                4959,
                0,
                DEFAULT_POETRY_OPTIONS,
            );

            expect(actual).toBeTrue();
        });

        it('should detect the valid pair that is centered', () => {
            const actual = isPoeticGroup(
                [
                    {
                        bbox: {
                            height: 93.2325592041014,

                            width: 600.22509765625,

                            x: 479.2495638535215,

                            y: 36.99999869252285,
                        },

                        text: 'أعادوا بها معنى سواع ومثله',
                    },
                    {
                        bbox: {
                            height: 74.4883728027343,

                            width: 609.5309448242188,

                            x: 1260.9380962813182,

                            y: 46.511627718234266,
                        },

                        text: 'يغوث وود بئس ذلك من ود',
                    },
                ],
                2480,
                0,
                DEFAULT_POETRY_OPTIONS,
            );

            expect(actual).toBeTrue();
        });

        it('should detect a valid pair even that has a footnote', () => {
            const actual = isPoeticGroup(
                [
                    {
                        bbox: {
                            height: 84.04650878906281,

                            width: 632,

                            x: 469.94373167906724,

                            y: 413.9534900240734,
                        },

                        text: 'وكم طائف حول القبور مقبلاً',
                    },
                    {
                        bbox: {
                            height: 114.97213745117172,

                            width: 664.7333374023438,

                            x: 1240.5349732146512,

                            y: 398.09846366479695,
                        },

                        text: 'ويستلم الأركان منهن باليد (١)',
                    },
                ],
                2480,
                0,
                DEFAULT_POETRY_OPTIONS,
            );

            expect(actual).toBeTrue();
        });

        it('should not detect a split up line as poetry', () => {
            const actual = isPoeticGroup(
                [
                    {
                        bbox: {
                            height: 222.41071428571385,
                            width: 627.9552903211753,
                            x: 757.240232419881,
                            y: 1257.1726190476193,
                        },
                        text: 'أليس اللَّه',
                    },
                    {
                        bbox: {
                            height: 240.3488254547117,
                            width: 2428.709411155177,
                            x: 1357.4917061605674,
                            y: 1266.4534951738071,
                        },
                        text: 'ل يقول: (إِنَّ الدِّينَ عِندَ ٱللَّهِ الْإِسْلَٰامُ)',
                    },
                ],
                4959,
                0,
                DEFAULT_POETRY_OPTIONS,
            );

            expect(actual).toBeFalse();
        });

        it('should detect the valid line', () => {
            const groups = [
                [
                    {
                        bbox: {
                            height: 268.44823428562677,
                            width: 4017.0670885857735,
                            x: 544.8435446307676,
                            y: 277.3255783167656,
                        },
                        text: 'عن معانيهم لأنفسهم، والإجمال والستر على من باينهم في طريقتهم ؛ لتكون',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 268.52159636361245,
                            width: 4007.832471075859,
                            x: 544.8435426451952,
                            y: 545.4069770215788,
                        },
                        text: 'معاني ألفاظهم مستبهمة على الأجانب؛ غيرة منهم أن يشيع استعمالها في غير',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 186.13095238095244,
                            width: 674.128474140895,
                            x: 526.3743098752797,
                            y: 831.2797619047623,
                        },
                        text: 'أهلها». اه.',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 221.86045056297607,
                            width: 3795.435883267235,
                            x: 748.0054843929938,
                            y: 1155.523262397291,
                        },
                        text: 'قلت: ليس الأمر كما قال المؤلف؛ بل أبهموا على غيرهم، أو جاءوا',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 249.5930249350411,
                            width: 4007.832471075859,
                            x: 526.3742781888523,
                            y: 1405.1162772701812,
                        },
                        text: 'بألفاظ محتملة حتى لا يحكم عليهم بالردة فيقتلوا، ولهذا حكى صاحب',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 231.10465004330618,
                            width: 2234.7820583663824,
                            x: 517.1397325700027,
                            y: 1682.4418614292913,
                        },
                        text: 'الكشف (ص ٥٠)، عن أبي مدين أنه قال :',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 265.77976090567466,
                            width: 3817.173297212324,
                            x: 616.9778192908329,
                            y: 1945.766513021073,
                        },
                        text: 'وفي السر أسرارٌ دقاق لطيفة تراق دمانا جهرةً لو بها بحنا',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 249.9598593938919,
                            width: 3823.1397357969795,
                            x: 720.3016364247173,
                            y: 2283.313952225133,
                        },
                        text: 'معنى هذا البيت أنهم يبطنون كلماتهم بمعان هي تعتبر عند أهل الشريعة',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 278.6152362823491,
                            width: 4019.4742273228776,
                            x: 543.5255713998667,
                            y: 2543.938187219862,
                        },
                        text: 'كفرًا وزندقة، ولو أظهروها لأبيحت دماؤهم وقتلوا بسببها، ونقل صاحب',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 222.41071428571456,
                            width: 2437.944028665091,
                            x: 507.905045468804,
                            y: 2828.244047619047,
                        },
                        text: 'الكشف أيضًا (ص٥٩)، عن ابن هود أنه قال :',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 295.8139501299178,
                            width: 3767.731645656906,
                            x: 627.9555025760064,
                            y: 3078.3139556653628,
                        },
                        text: 'علمُ قومي بي جهل إن شأني لأجلُّ',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 258.94726753234863,
                            width: 1865.3965878086237,
                            x: 572.5475456774307,
                            y: 3374.017852695907,
                        },
                        text: 'أنا عبدٌ أنا ربٌّ',
                    },
                    {
                        bbox: {
                            height: 258.94726753234863,
                            width: 1893.100440338368,
                            x: 2557.994506287425,
                            y: 3374.0178519176575,
                        },
                        text: 'أنا عز أنا ذلَّ',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 231.87499999999952,
                            width: 1856.1619702987089,
                            x: 581.7821504671731,
                            y: 3678.452380952381,
                        },
                        text: 'أنا دنيا أنا أخرى',
                    },
                    {
                        bbox: {
                            height: 287.2667385282968,
                            width: 1865.3965878086233,
                            x: 2548.7598208050827,
                            y: 3651.453494339285,
                        },
                        text: 'أنا بعضٌ أنا كلُّ',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 249.5930249350411,
                            width: 1883.8658228284528,
                            x: 591.0168394212194,
                            y: 3974.9999981519295,
                        },
                        text: 'أنا معشوق لذاتي',
                    },
                    {
                        bbox: {
                            height: 213.16653887430834,
                            width: 1828.4581177689647,
                            x: 2594.932973943635,
                            y: 3984.244180728958,
                        },
                        text: 'لست عنه الدهر أسلو',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 203.51882389613567,
                            width: 3740.027793127162,
                            x: 784.9442323125213,
                            y: 4307.790699050686,
                        },
                        text: '* أقول : يجب على من يقول أن الصوفية من مذاهب أهل السنة والجماعة',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 268.5215963636131,
                            width: 4026.301706095688,
                            x: 517.1396672854689,
                            y: 4520.406975904572,
                        },
                        text: 'أن يستغفر اللَّه كثيرًا؛ لعلَّ اللَّه أن يتوب عليه من هذا القول السيئ، فإن',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 249.84981627691374,
                            width: 4026.301706095687,
                            x: 507.905045468804,
                            y: 4825.208328295651,
                        },
                        text: 'الصوفية في هذا الزمن هي الصوفية التي تجعل العبد ربَّا، والعكس ؛ لتمزج',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 231.10465004330618,
                            width: 2419.474793645262,
                            x: 535.6089880271143,
                            y: 5112.034884537456,
                        },
                        text: 'بين الخالق والمخلوق، ولهذا يقول شاعرهم :',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 231.10465004330547,
                            width: 1883.8658228284528,
                            x: 600.2514552090613,
                            y: 5380.11627912108,
                        },
                        text: 'الربُّ عبدٌ والعبد رب',
                    },
                    {
                        bbox: {
                            height: 240.3488254547124,
                            width: 1828.4581177689647,
                            x: 2576.463677990971,
                            y: 5389.360471178457,
                        },
                        text: 'فليت شعري من المكلف',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 240.3488254547124,
                            width: 3767.731645656906,
                            x: 748.0057013406131,
                            y: 5703.662796420899,
                        },
                        text: 'وهذا ابن هود يقول في الأبيات السابقة، واصفًا لنفسه بأنه قد جمع بين',
                    },
                ],
                [
                    {
                        bbox: {
                            height: 231.10465004330618,
                            width: 4007.8324710758584,
                            x: 526.3742930726762,
                            y: 5971.7441871454985,
                        },
                        text: 'المتناقضات، فهو عبدٌ وربُّ في آن واحد، وهو دنيا وأخرى في آن واحد،',
                    },
                ],
            ];

            const avgProseWordDensity = calculateAverageProseDensity(groups.flat(), 4959, DEFAULT_POETRY_OPTIONS);

            const poetry = groups
                .filter((g) => {
                    return isPoeticGroup(g, 4959, avgProseWordDensity, DEFAULT_POETRY_OPTIONS);
                })
                .flat()
                .map((o) => o.text);

            expect(poetry).toEqual([
                'وفي السر أسرارٌ دقاق لطيفة تراق دمانا جهرةً لو بها بحنا',
                'علمُ قومي بي جهل إن شأني لأجلُّ',
                'أنا عبدٌ أنا ربٌّ',
                'أنا عز أنا ذلَّ',
                'أنا دنيا أنا أخرى',
                'أنا بعضٌ أنا كلُّ',
                'أنا معشوق لذاتي',
                'لست عنه الدهر أسلو',
                'الربُّ عبدٌ والعبد رب',
                'فليت شعري من المكلف',
            ]);
        });
    });
});
